Repository: pypi-data/pypi-mirror-355
Catalog: packages/fb-tools/fb_tools-2.8.1.tar.gz/fb_tools-2.8.1/locale/*/LC_MESSAGES/fb_tools.po
Languages: de

source: How many files one per year from today on should be kept (default: {default}, minimum: {min})?
de: Wieviele Dateien (eine pro Jahr) sollen von heute an rückwärts aufbewahrt werden (Vorgabe: {default}, Minimum {min})?

source: Resolving date pattern {!r}.
de: Löse Datumsmuster {!r} auf.

source: Checking given files...
de: Überprüfe übergebene Dateien …

source: Checking given file {!r} ...
de: Überprüfe übergebene Datei {!r} …

source: Resolved paths:
de: Aufgelöste Pfade:

source: File pattern {!r} does not match any files.
de: Das Dateimuster {!r} passt auf keine Dateien.

source: Checking {!r} ...
de: Überprüfe {!r} …

source: File {!r} is a regular file.
de: Die Datei {!r} ist eine reguläre Datei.

source: Path {!r} is a directory.
de: Der Pfad {!r} ist ein Verzeichnis.

source: File {fi!r} does not match pattern {pa!r}.
de: Die Datei {fi!r} passt nicht in das Dateimuster {pa!r}.

source: Date in file {fi!r} is not a valid date: {e}.
de: Das Datum in der Datei {fi!r} ist kein gültiges Datum: {e}.

source: Did not found any files to evaluate.
de: Fand keine Dateien zur Auswertung

source: Keeping last file ...
de: Behalte die letzte Datei …

source: Keep last file {!r}.
de: Behalte die letzte Datei {!r}.

source: Files to keep:
de: Zu behaltende Dateien:

source: Files to keep for year:
de: Dateien, die für Jahr zu behalten sind:

source: Got last month: {!r}
de: Ermittelter letzter Monat: {!r}

source: Files to keep for month:
de: Dateien, die für Monat zu behalten sind:

source: Got last Monday: {!r}
de: Ermittelter letzter Montag: {!r}

source: Files to keep for week:
de: Dateien, die für Woche zu behalten sind:

source: Got last day: {!r}
de: Ermittelter letzter Tag: {!r}

source: Keeping all files from today.
de: Aufheben aller Dateien von heute.

source: Files to keep for day:
de: Dateien, die für Tag zu behalten sind:

source: Trying to get date of file {!r}.
de: Versuche das Datum aus der Datei {!r} zu entnehmen.

source: Explored and assigned files:
de: Ermittelte und zugewiesene Dateien:

source: Invalid time zone name {!r}.
de: Ungültiger Zeitzonenname {!r}.

source: Setting time zone to {!r}.
de: Setze Zeitzone auf {!r}.

source: Name of the time zone: {!r}.
de: Name der Zeitzone: {!r}.

source: {}-object not initialized.
de: Das {}-Objekt ist noch nicht initialisiert.

source: Method {} must be overridden in descendant classes.
de: Die Methode {} muss in abgeleiteten Klassen überschrieben werden.

source: Quiet execution.
de: Stillschweigende Ausführung.

source: Starting synchronous communication with '{}'.
de: Starte synchrone Kommunikation mit '{}'.

source: Finished communication with '{}'.
de: Kommunikation mit '{}' beendet.

source: Parameter {p!r} is not of type {t!r}.
de: Der Parameter {p!r} ist nicht vom Typ {t!r}.

source: Got completed process:
de: Vollendeten Prozess erhalten:

source: Output on {}:
de: Ausgabe an {}:

source: Starting asynchronous communication with '{cmd}', heartbeat interval is {interval:0.1f} seconds.
de: Starte asynchrone Kommunikation mit '{cmd}', Herzschlag-Intervall ist {interval:0.1f} Sekunden.

source: Checking for the end of the communication ...
de: Überprüfe das Ende der Kummunikation …

source: Time to execute the heartbeat handler.
de: Es ist an der Zeit, den Herzschlag-Handler auszuführen.

source: Sleeping {:0.2f} seconds ...
de: Schlafe für {:0.2f} Sekunden …

source: {w} is now: {o!r}
de: {w} ist jetzt: {o!r}

source: Locking directory {!r} doesn't exists or is not a directory.
de: Das Lockverzeichnis {!r} existiert entweder nicht oder ist kein Verzeichnis.

source: Locking directory {!r} isn't writeable.
de: Kein Schreibzugriff auf das Lockverzeichnis {!r}.

source: No lockfile given on init of a LockObject object.
de: Keine Lockdatei bei der Initialisierung des LockObject-Ojektes angegeben.

source: Lockfile {!r} doesn't exists, but don't worry, it's simulation mode.
de: Die Lockdatei {!r} existiert nicht, aber keine Sorge, wir sind im Simulationsmodus.

source: Lockfile {!r} doesn't exists.
de: Die Lockdatei {!r} existiert nicht.

source: Lockfile {!r} is not a regular file.
de: Die Lockdatei {!r} ist keine reguläre Datei.

source: Closing file descriptor {} ...
de: Schließe Datei-Deskriptor {} …

source: Automatic removing of {!r} ...
de: Automatisches Löschen von {!r} …

source: Refreshing atime and mtime of {!r} to the current timestamp.
de: Setze atime und mtime von {!r} auf den aktuellen Zeitstempel.

source: Value {val!r} for {what} is not a Number.
de: Der Wert {val!r} für {what} ist keine Zahl.

source: The value for {what} must be greater than zero (is {val!r}).
de: Der Wert für {what} muss größer als Null sein (ist {val!r}).

source: The value for {what} must be greater than or equal to zero (is {val!r}).
de: Der Wert für {what} muss größer als oder gleich Null sein (ist {val!r}).

source: Invalid PID {} given on calling create_lockfile().
de: Ungültige PID {} beim Aufruf von create_lockfile() übergeben.

source: Using lock directory {!r} ...
de: Verwende Lock-Verzeichnis {!r} …

source: Trying to lock lockfile {!r} ...
de: Versuche Lockdatei {!r} zu okkupieren …

source: Current time difference: {:0.3f} seconds.
de: Aktuelle Zeitdifferenz: {:0.3f} Sekunden.

source: Try {try_nr} on creating lockfile {lfile!r} ...
de: Versuch Nummer {try_nr} zum Erstellen der Lockdatei {lfile!r} …

source: Removing lockfile {!r} ...
de: Lösche Lockdatei {!r} …

source: Error on removing lockfile {lfile!r}: {err}
de: Fehler beim Löschen der Lockdatei {lfile!r): {err}

source: Sleeping for {:0.1f} seconds.
de: Schlafe für {:0.1f} Sekunden.

source: Got a lock for lockfile {!r}.
de: Habe einen Lock für die Lockdatei {!r} erhalten.

source: Write {what!r} in lockfile {lfile!r} ...
de: Schreibe {what!r} in Lockdatei {lfile!r} …

source: Seeking and syncing {!r} ...
de: Seeken und synchronisieren von {!r} …

source: Trying to open {!r} exclusive ...
de: Versuche {!r} exklusiv zu öffnen …

source: Simulation mode, no real creation of a lockfile.
de: Simulationsmodus, Lockdatei wird in Wirklichkeit nicht erstellt.

source: Error on creating lockfile {lfile!r}: {err}
de: Fehler beim Erstellen der Lockdatei {lfile!r}: {err}

source: Lockfile {!r} to remove doesn't exists.
de: Die zu löschende Lockdatei {!r} existiert nicht.

source: Simulation mode - lockfile won't removed.
de: Simulationsmodus - die Lockdatei wird nicht gelöscht.

source: Checking lockfile {!r} ...
de: Überprüfe Lockdatei {!r} …

source: No read access for lockfile {!r}.
de: Kein Lesezugriff auf Lockdatei {!r}.

source: No write access for lockfile {!r}.
de: Kein Schreibzugriff auf Lockdatei {!r}.

source: Unusable lockfile {!r}.
de: Nicht verwendungsfähige Lockdatei {!r}.

source: Process with PID {} is unfortunately dead.
de: Der Prozess mit der PID {} ist unglücklicherweise verstorben.

source: Process with PID {} is still running.
de: Der Prozess mit der PID {} läuft aktuell noch.

source: Could not stat for file {lfile!r}: {err}
de: Konnte Stat-Daten für Datei {lfile!r} nicht ermitteln: {err}

source: Lockfile {lfile!r} is older than {max} seconds ({age} seconds).
de: Die Lockdatei {lfile!r} ist älter als {max} Sekunden ({age} Sekunden).

source: Lockfile {lfile!r} is {age} seconds old, but not old enough ({max} seconds).
de: Die Lockdatei {lfile!r} ist {age} Sekunden alt, aber nicht alte genug ({max} Sekunden).

source: Trying to open pidfile {!r} ...
de: Versuche PID-Datei {!r} zu öffnen …

source: Could not open pidfile {!r} for reading:
de: Konnte PID-Datei {!r} nicht zum Lesen öffnen:

source: First line of pidfile {!r} was empty.
de: Die erste Zeile der PID-Datei {!r} war leer.

source: Could not interprete {cont!r} as a PID from {file!r}: {err}
de: Konnte {cont!r} nicht als PID (in {file!r}) interpretieren: {err}

source: Invalid PID {pid} in {file!r} found.
de: Ungültige PID {pid} in Datei {file!r} gefunden.

source: Timeout on communicating with process.
de: Zeitüberschreitung in der Kommunikation mit einem Prozess.

source: Command {c!r} returned non-zero exit status {rc}.
de: Das Kommando {c!r} gab den Nicht-Null Wert {rc} zurück.

source: Command {c!r} timed out after {s} second.
de: Das Kommando {c!r} timte nach einer Sekunde aus.

source: Wrong prompt timeout {v!r}, must be greater or equal to Null and less or equal to {max}.
de: Falscher Eingabe-Timeout {v!r}, er muss größer oder gleich Null sowie kleiner oder gleich {max} sein.

source: Wrong address family {!r} given. Valid values are:
de: Ungültige Adressfamilie {!r} übergeben. Gültige Werte sind:

source: yes
de: ja

source: no
de: nein

source: No hostname or IP address given on calling get_address().
de: Kein Hostname oder IP-Adresse beim Aufruf von get_address() übergeben.

source: Searching for command {!r} ...
de: Suche nach Befehl {!r} …

source: Command {!r} doesn't exists.
de: Das Befehl {!r} existiert nicht.

source: Command {!r} is not executable.
de: Das Befehl {!r} ist nicht ausführbar.

source: Searching command in {!r} ...
de: Suche Befehl in {!r} …

source: Command {!r} not found.
de: Das Kommando {!r} wurde nicht gefunden.

source: STDIN and input arguments may not both be used.
de: STDIN und Eingabe-Argumente dürfen nicht zusammen verwendet werden.

source: Executing command args:
de: Auszuführende Befehlsargumente:

source: Performing argument {!r}.
de: Verarbeite Argument {!r}.

source: Executing: {}
de: Ausführung: {}

source: Simulation mode, not executing: {}
de: Simulations-Modus, führe nicht aus: {}

source: PID of process: {}
de: PID des Prozesses: {}

source: {c} happened, killing process: {e}
de: {} aufgetreten, töte Prozess: {e}

source: Nothing to do on signal.
de: Aud das Signal gibt es nichts zu tun.

source: File doesn't exists.
de: Die Datei existiert nicht.

source: Read permission denied.
de: Lesezugriff verboten.

source: Reading file content of {!r} ...
de: Lese Inhalt der Datei {!r} …

source: Write permission to {!r} denied.
de: Schreibzugriff auf {!r} verboten.

source: Write permission denied.
de: Schreibzugriff verboten.

source: Write {what!r} into {to!r}.
de: Schreibe {what!r} nach {to!r}.

source: Writing {!r} ...
de: Schreibe {!r} …

source: Simulating write into {!r}.
de: Simuliere das Schreiben nach {!r}.

source: Opening {!r} for write unbuffered ...
de: Öffne {!r} zum ungepufferten Schreiben …

source: Closing {!r} ...
de: Schließe {!r} …

source: Password:
de: Passwort:

source: Repeat password:
de: Passwort Wiederholung:

source: The entered passwords does not match.
de: Die eingegebenen Passwörter stimmen nicht überein.

source: Interrupted on demand.
de: Abbruch auf Verlangen.

source: Got a {}:
de: Habe ein {} erhalten:

source: Yes/No
de: Ja/Nein

source: Automatic answer: '{}'.
de: Automatische Antwort: '{}'.

source: Parameter {t!r} must be a {e}, {v!r} was given.
de: Der Parameter {t!r} muss ein {e} ein, statt dessen wurde {v!r} übergeben.

source: Completed process
de: Fertiggestellter Prozess

source: Empty address.
de: Leere Adresse.

source: Wrong type.
de: Falscher Typ.

source: Invalid address.
de: Ungültige Adresse.

source: Given user: {u!r}, given domain: {d!r}.
de: Gegebener Nutzer: {u!r}, gegebene Domäne: {d!r}.

source: Invalid mail address.
de: Ungültige Mailadresse.

source: Invalid user/mailbox name.
de: Ungültiger Nutzer- bzw. Postfachname.

source: Invalid domain.
de: Ungültige Domäne.

source: Wrong verbose level {!r}, must be >= 0
de: Falsches Ausführlichkeits-Niveau, muss größer als oder gleich Null sein

source: Checking equality {self!r} with {other!r} ...
de: Vergleiche Gleichheit von {self!r} mit {other!r} …

source: Object {o!r} for comparing is not a {c} object.
de: Das Vergleichsobjekt {o!r} ist kein {c}-Objekt.

source: Comparing {self!r} with {other!r} ...
de: Vergleiche {self!r} mit {other!r} …

source: Evaluating address {!r} ...
de: Untersuche Adresse {!r} …

source: Search pattern simple: {}
de: Einfaches Suchmuster: {}

source: Search pattern full: {}
de: Vollständiges Suchmuster: {}

source: Parameters {lst} may not be given, if parameter {a!r} was given.
de: Die Parameter {lst} dürfen nicht übergeben werden, wenn der Parameter {a!r} angegeben wurde.

source: Invalid full user name.
de: Ungültiger vollständiger Nutzername.

source: Given object {o!r} is not a sequence type, but a {t!r} type instead.
de: Das übergebene Objekt {o!r} ist kein sequentieller Typ, aber statt dessen vom Typ {t!r}.

source: {m} takes at most {max} arguments ({n} given).
de: {m} akzeptiert höchstens {max} Argumente ({n} wurden gegeben).

source: Mail address {} is not in address list.
de: Die Mailadresse {} ist nicht in der Adressliste.

source: {} configuration is not supported.
de: {}-Konfiguration wird nicht unterstützt.

source: Additional config file {!r} does not exists.
de: Die zusätzliche Konfigurationsdatei {!r} existiert nicht.

source: Configuration file {!r} is not readable.
de: Die Konfigurations-Datei {!r} ist nicht lesbar.

source: Configuration directory {!r} may not be absolute.
de: Das Konfigurations-Verzeichnis {!r} darf nicht absolut sein.

source: Cannot use {!r} as delimiters for ini-files.
de: Kann {!r} nicht als Trennzeichen für ini-Dateien verwenden.

source: Cannot use {!r} as comment prefixes for ini-files.
de: Kann {!r} nicht als Kommentar-Präfix für ini-Dateien verwenden.

source: Cannot use {!r} as inline comment prefixes for ini-files.
de: Kann {!r} nicht als Inline-Kommentar-Präfix für ini-Dateien verwenden.

source: Evaluation of configuration could only be happen after reading it.
de: Die Evaluierung der Konfiguration kann erst erfolgen, nachdem die gelesen wurde.

source: Invalid value {val!r} in section {sec!r} for console timeout.
de: Ungültiger Wert {val!r} für Konsolen-Timeout in Abschnitt {sec!r}.

source: Collecting all configuration files.
de: Sammle alle Konfigurationsdateien.

source: Discovering config directory {!r} ...
de: Untersuche Konfigurations-Verzeichnis {!r} …

source: Collected config files:
de: Gesammelte Konfigurationsdateien:

source: Checking permissions of config files ...
de: Überprüfe Rechte auf Konfigurationsdateien …

source: Checking permissions of {!r} ...
de: Überprüfe Rechte auf {!r} …

source: Found file permissions of {fn!r}: {mode:04o}
de: Fand Datei-Rechte auf {fn!r}: {mode:04o}

source: File {fn!r} is readable by group or by others, found mode {mode:04o}.
de: Die Datei {fn!r} ist für die Gruppe oder für andere lesbar, gefundener Modus {mode:04o}.

source: Possible usable config directories:
de: Möglicherweise verwendbares Konfigurationsverzeichnis:

source: Possible usable config files:
de: Möglicherweise verwendbare Konfigurationsdateien:

source: Path {!r} is a unusable directory.
de: Der Pfad {!r} ist ein nicht verwendbares Verzeichnis.

source: Path {!r} is not a regular file.
de: Der Pfad {!r} ist keine reguläre Datei.

source: File {!r} is not useable.
de: Die Datei {!r} ist nicht verwendbar.

source: Got file info for {!r}:
de: Erhaltene Dateiinformationen für {!r}:

source: Trying to detect file type of file {!r}.
de: Versuche den Dateityp der Datei {!r} zu ermitteln.

source: Checking file {fn!r} for pattern {pat!r}.
de: Überprüfe Datei {fn!r} nach Muster {pat!r}.

source: Found config file {fi!r}, loader method {m!r}.
de: Fand Konfigurationsdatei {fi!r}, Lademethode {m!r}.

source: Did not found file type of config file {fn!r}. Available config types are: {list}.
de: Keinen Dateityp der Datei {fn!r} gefunden. Verfügbare Konfigurationstypen sind: {list}.

source: Checking, whether {!r} is a possible config file.
de: Teste, ob {!r} möglicherweise eine Konfigurationsdatei ist.

source: Prepending {!r} to config files.
de: Füge {!r} an den Anfang der Liste der Konfigurationsdateien ein.

source: Appending {!r} to config files.
de: Hänge {!r} am Ende der Liste der Konfigurationsdateien an.

source: Loading method of {fn!r} is: {m!r}.
de: Lade-Methode von{fn!r} ist: {m!r}.

source: Trying to append file {!r} to the list of config files ...
de: Versuche die Datei {!r} an die Liste der Konfigurationsdateien anzuhängen …

source: Trying to prepend file {!r} to the list of config files ...
de: Versuche die Datei {!r} am Anfang der Liste der Konfigurationsdateien einzufügen …

source: Trying to add additional config file {!r}.
de: Versuche die zusätzliche Konfigurationsdatei {!r} hinzuzufügen.

source: Checking directory {!r} for all config files ...
de: Überprüfe das Verzeichnis {!r} nach allen Konfigurationsdateien ….

source: Checking {!r} as a possible config file.
de: Teste, ob {!r} möglicherweise eine Konfigurationsdatei ist.

source: Stem {!r} is not a String type.
de: Der Konfigurations-Namens-Stamm {!r} ist kein String-Typ.

source: File name stem {!r} is invalid.
de: der Konfigurations-Namens-Stamm {!r} ist ungültig.

source: Invalid configuration type {t!r} - not found in {w!r}.
de: Ungültiger Konfigurationstyp {t!r} - wurde nicht in {w!r} gefunden.

source: Reading configuration file {!r} ...
de: Lese Konfigurationsdatei {!r} …

source: Using loading method {!r}.
de: Verwende Lade-Methode {!r}.

source: Read config from {fn!r}:
de: Von {fn!r} gelesene Konfiguration:

source: Read merged config:
de: Gelesene und zusammengeführte Konfiguration:

source: Character set detection by module {mod!r} for file {fn!r} should not be used, using character set {enc!r}.
de: Die Zeichesatzerkennung durch das Modul {mod!r} für die Datei {fn!r} soll nicht verwendet werden, verwende Zeichensatz {enc!r}.

source: Trying to detect character set of file {fn!r} ...
de: Versuche den Zeichensatz der Datei {fn!r} zu ermitteln …

source: The confidence of {con:0.1f}% is lower than the limit of {lim:0.1f}%, using character set {cs_def!r} instead of {cs_found!r}.
de: Die Zuverlässigkeit von {con:0.1f}% ist kleiner als das Limit von {lim:0.1f}%, verwende den Zeichensatz {cs_def!r} anstelle von {cs_found!r}.

source: Got {what} on detecting cheracter set of {fn!r}: {e}
de: Erhielt {what} bei der Zeichensatzerkennung von {fn!r}: {e}.

source: Found character set {cs!r} for file {fn!r} with a confidence of {con:0.1f}%.
de: Fand Zeichensatz {cs!r} für die Datei {fn!r} mit einer Zuverlässigkeit von {con:0.1f}%.

source: Reading {tp} file {fn!r} ...
de: Lese {tp}-Datei {fn!r} …

source: {what} parse error in {fn!r}, line {line}, column {col}: {msg}
de: {what} Parse-Fehler in {fn!r}, Zeine {line}, Spalte {col}: {msg}

source: Got {what} on reading and parsing {fn!r}: {e}
de: Habe {what} beim Lesen und Parsen von {fn!r} erhalten: {e}.

source: Arguments on initializing {}:
de: Argumente zur Initialisierung von {}:

source: The base directory {!r} is not existing or not a directory.
de: Das Basis-Verzeichnis {!r} existiert nicht oder ist kein Verzeichnis.

source: undefined error.
de: unbestimmter Fehler.

source: Exception happened
de: Aufgetretene Ausnahme

source: Base directory {!r} does not exists.
de: Das Basis-Verzeichnis {!r} existiert nicht.

source: Path for base directory {!r} is not a directory.
de: Der Pfad zum Basis-Verzeichnis {!r} is kein Verzeichnis

source: Invalid pidfile {f!r} given: {r}
de: Ungültige PID-Datei {f!r} übergeben: {r}

source: Invalid pidfile {!r} given.
de: Ungültige PID-Datei {!r} übergeben.

source: The pidfile {f!r} is currently in use by the application with the PID {p}.
de: Die PID-Datei {f!r} wird gegenwärtig von der Anwendung mit der PID {p} verwendet.

source: No filename given on initializing {} object.
de: Kein Dateiname bei der Initialisierung des {}-Ojektes angegeben.

source: Pidfile {!r} doesn't exists, not removing.
de: Die PID-Datei {!r} existiert nicht, und wird deshalb auch nicht gelöscht.

source: Auto removing disabled, don't deleting {!r}.
de: Automatisches Löschen deaktiviert, {!r} wird nicht gelöscht.

source: Removing pidfile {!r} ...
de: Lösche PID-Datei {!r} …

source: Just kidding ...
de: Ich mach doch nur Spaß …

source: Could not delete pidfile {f!r}: {e}
de: Konnte PID-Datei {f!r} nicht löschen: {e}

source: Invalid PID {p} for creating pidfile {f!r} given.
de: Ungültige PID {p} zur Erstellung der PID-Datei {f!r} übergeben.

source: Deleting pidfile {!r} ...
de: Lösche PID-Datei {!r} …

source: Trying opening {!r} exclusive ...
de: Versuche {!r} exklusiv zu öffnen …

source: Simulation mode - don't real writing in {!r}.
de: Simulationsmodus - es wird nicht wirklich nach {!r} geschrieben.

source: Error on creating pidfile {f!r}: {e}
de: Fehler beim Erstellen der PID-Datei {f!r}: {e}

source: Writing {p} into {f!r} ...
de: Schreibe {p} nach {f!r} …

source: Calling {} on a not self created pidfile.
de: Aufruf von {} bei einer nicht selbst erstellten PID-Datei.

source: Trying opening {!r} for recreate ...
de: Versuche {!r} zum Wiedererstellen zu öffnen …

source: Error on recreating pidfile {f!r}: {e}
de: Fehler beim Wiedererstellen der PID-Datei {f!r}: {e}

source: Pidfile parent directory {!r} doesn't exists.
de: Das Eltern-Verzeichnis der PID-Datei {!r} existiert nicht.

source: Pidfile parent directory {!r} is not a directory.
de: Das Eltern-Verzeichnis der PID-Datei {!r} is kein Verzeichnis

source: No write access to pidfile parent directory {!r}.
de: Kein Schreibzugriff auf das Eltern-Verzeichnis der PID-Datei {!r}.

source: It is not a regular file.
de: Es ist keine reguläre Datei.

source: Reading content of pidfile {!r} ...
de: Lese Inhalt der PID-Datei {!r} …

source: No useful information found in pidfile {f!r}: {z!r}
de: Keine sinnvollen Informationen in der PID-Datei {f!r} gefunden: {z!r}

source: Trying check for process with PID {} ...
de: Versuche den Prozess mit der PID {} zu überprüfen …

source: Process with PID {} anonymous died.
de: Der Prozess mit der PID {} ist anonym verstorben.

source: No permission to signal the process {} ...
de: Keine Rechte zum Senden von Signalen an Prozess {} …

source: Waiting ...
de: Warten …

source: Shows one or more spinners, and their names, if multiple spinners should be shown. If no spinner is given, a random spinner will be displayed.
de: Zeigt einen oder mehrere Spinner, sowie deren Namen, wenn mehrere Spinner dargestellt werden sollen. Wenn kein Spinner angegeben wird, wird ein zufällig ausgewählter anhgezeigt.

source: A negative time for showing the spinner {v!r} is not allowed.
de: Eine negative Zeitangabe zum Zeigen der Spinne {v!r} ist nicht gestattet.

source: Options for {}
de: Optionen für {}

source: The prompt displayed before the spinner, if only one spinner should be shown. Default: {!r}.
de: Der Prompt, der vor dem Spinner angezeigt werden soll, wenn nur ein Spinner gezeigt werden soll. Vorgabe: {!r}.

source: The time in seconds for displaying each spinner.
de: Die Zeit in Sekunden, die ein Spinner gezeigt werden soll.

source: The spinners, which should be displayed. If not given, a random spinner will be displayed, which is the same as giving {rand!r} as the name of the spinner. If giving {list!r}, a simple list of all available spinners will be shown, without displaying them. If giving {all!r}, all available spinners will be shown.
de: Die Spinner, die gezeigt werden sollen. Wenn keiner angegeben wird, wird ein zufällig ausgewählter angezeigt, was identisch ist mit der einmaligen Angabe von {rand!r} als Spinnername. Wird {list!r} angegeben, wird eine einfache Liste der verfügbaren Spinnernamen ausgegeben, ohne die Spinner selbst anzuzeigen. Wird {all!r} angegeben, werden alle verfügbaren Spinner dargestellt.

source: You may give {!r} only as the only spinner.
de: Man darf {!r} nur als einzigen Spinner angeben.

source: Invalid spinner {!r} given.
de: Ungültiger Spinnet {!r} übergeben.

source: All available spinners:
de: Alle verfügbaren Spinner:

source: A timeout for a socket operation may not be equal or less then zero.
de: Ein Timeout für eine Sockel-Operation darf nicht kleiner oder gleich Null sein.
