Repository: pypi-data/pypi-mirror-355
Catalog: packages/fb-tools/fb_tools-2.8.1.tar.gz/fb_tools-2.8.1/locale/*/LC_MESSAGES/fb_tools.po
Languages: de

source: {c}-Object: {a}
de: {c}-Objekt: {a}

source: Forced execution - whatever it means.
de: Forcierte Ausführung, was auch immer das bedeuten mag.

source: Invalid env_prefix {!r} given - it may not be empty.
de: Ungültiger env_prefix {!r} übergeben - er darf nicht leer sein.

source: Invalid characters found in env_prefix {!r}, only alphanumeric characters and digits and underscore (this not as the first character) are allowed.
de: Ungültige Zeichen in env_prefix {!r} gefunden, nur alphanumerische Zeichen und Unterstriche (diese aber nicht als erstes Zeichen) sind erlaubt.

source: Unknown and undescriped application.
de: Unbekannte und nicht beschriebene Anwendung.

source: Wrong exit_value {!r}, must be >= 0.
de: Falscher Wert für exit_value {!r}, muss größer als oder gleich Null sein.

source: Trying to get {} via console ...
de: Versuche {} über die Konsole zu bekommen …

source: Got a signal {}.
de: Erhielt ein Signal {}.

source: Got a signal {n!r} ({s}).
de: Erhielt ein Signal {n!r} ({s}).

source: Exit on signal {n!r} ({s}).
de: Beendigung auf Signal {n!r} ({s}).

source: Tweaking signal handlers.
de: Schraube an den Signalhandlern.

source: Setting signal handler for {n!r} ({s}).
de: Setze Signalhandler für {n!r} ({s}).

source: Enter
de: Eingabe von

source: Repeat enter
de: Wiederholen der Eingabe von

source: {n} and repeated {n} did not match.
de: {n} und das wiederholte {n} stimmen nicht überein.

source: Restoring original signal handlers.
de: Stelle original Signalhandler wieder her.

source: Got {n!r}: {s!r}
de: Erhielt {n!r}: {s!r}

source: The application is not completely initialized.
de: Die Anwendung ist nicht vollständig initialisiert.

source: Object {!r} seems not to be completely initialized.
de: Das {!r}-Objekt scheit noch nicht vollständig initialisiert zu sein.

source: Ending.
de: Beenden.

source: Executing {} ...
de: Führe {} aus …

source: General options
de: Allgemeine Optionen

source: Simulation mode, nothing is really done.
de: Simulations-Modus, es wird nichts wirklich verändert.

source: Automatically answer '{}' for all questions.
de: Automatisch alle Fragen mit {} beantworten.

source: Yes
de: Ja

source: No
de: Nein

source: SECONDS
de: SEKUNDEN

source: The timeout in seconds for console input. Default: {}
de: Die Zeit für die Zeitüberschreitung in Sekunden für Konsolen-Eingaben Vorgabe: {}.

source: Use colored output for messages.
de: Verwenden kolorierter Ausgabe für Mitteilungen.

source: Increase the verbosity level
de: Erhöhen des Ausführichkeits-Niveaus

source: Silent execution, only warnings and errors are emitted.
de: Stillschweigende Ausführung, nur Warnungen und Fehler werden ausgegeben.

source: Show this help message and exit.
de: Zeigt diesen Hilfe-Bildschirm und beendet sich.

source: Display brief usage message and exit.
de: Zeigt eine kurze Darstellug zur Verwendung und beendet sich.

source: Version of %(prog)s: {}
de: Version von %(prog)s: {}

source: Show program's version number and exit.
de: Stellt die Programm-Version dar und beendet sich.

source: Starting in:
de: Start in:

source: Aborted by user interrupt.
de: Abbruch durch Benutzer-Unterbrechung.

source: Got a {c} for pattern {p!r}: {e}
de: Habe ein(e) {c} zum Suchmuster {p!r} erhalten: {e}

source: The path {!r} must be an absolute path.
de: Der Pfad muss ein absoluter Pfad sein.

source: The directory {!r} does not exists.
de: Das Verzeichnis {!r} existiert nicht.

source: The given path {!r} exists, but is not a directory.
de: Der angegebene Pfad {!r} existiert, ist aber kein Verzeichnis.

source: The given directory {!r} is not readable.
de: Das angegebene Verzeichnis {!r} ist nicht lesbar.

source: The given directory {!r} is not writeable.
de: In das angegebene Verzeichnis {!r} kann nicht geschrieben werden.

source: Directory {!r} does not exists.
de: Das Verzeichnis {!r} existiert nicht.

source: Path {!r} exists, but is not a directory.
de: Der angegebene Pfad {!r} existiert, ist aber kein Verzeichnis.

source: File {!r} is not a regular file.
de: Die Datei {!r} ist keine reguläre Datei.

source: File {!r} is not writeable.
de: Die Datei {!r} ist nicht schreibbar.

source: Directory {!r} is not writeable.
de: In das angegebene Verzeichnis {!r} kann nicht geschrieben werden.

source: File {!r} does not exists.
de: Die Datei {!r} existiert nicht.

source: A timeout must be greater than zero and less or equal to {}.
de: Ein Timeout muss größer als Null und kleiner oder gleich {} sein.

source: Wrong timeout {!r}:
de: Ungültiger Timeout {!r}:

source: Parameter {cls!r} must be a subclass of {clinfo!r}.
de: Der Parameter {cls!r} muss eine von {clinfo!r} abgeleitete Klasse sein.

source: Config options and options for logging
de: Konfigurations- und Logging-Optionen

source: FILE
de: DATEI

source: Configuration files to use additional to the standard configuration files.
de: Zusätzlich zu den Standard-Konfigurationsdateien zu benutzende Dateien.

source: A logfile for storing all logging output.
de: Eine Logdatei, um alle Log-Ausgaben hineinzuschreiben.

source: Default: {!r}.
de: Vorgabe: {!r}.

source: Got command line arguments:
de: Erhaltene Kommandozeilen-Argumente:

source: Error on reading configuration:
de: Fehler beim Lesen der Konfiguration:

source: Got a {c}: {e}.
de: Hab eine(e) {c} erhalten: {e}.

source: file is not writeable.
de: die Datei ist nicht schreibbar.

source: no write access to directory.
de: kein Schreibzugriff auf das Verzeichnis.

source: Start logging into file {!r} ...
de: Beginne Logging in Datei {!r} …

source: Item {item!r} must be of type {must!r}, but is of type {cls!r} instead.
de: Der Eintrag {item!r} muss vom Typ {must!r} sein, ist aber statt dessen vom Typ {cls!r}.

source: Object {o!r} is not a {e} object.
de: Das Objekt {o!r} ist kein {e}-Objekt.

source: Key {key!r} must be of type {must!r}, but is of type {cls!r} instead.
de: Der Schlüssel muss vom Typ {must!r} sein, ist aber statt dessen vom Typ {cls!r}.

source: Object is neither a {m} object, nor a sequential object, but a {o!r} object instead.
de: Das Objekt ist weder ein {m}-Objekt noch ein sequentielles Objekt, aber statt dessen vom Typ {o!r}.

source: Key {!r} is not existing.
de: Der Schlüssel {!r} existiert nicht.

source: Could update {ex} with {i!r}: {m}
de: Konnte {ex} nicht mit {i!r} updaten: {m}

source: Parameter {p!r} is not a sequence type, but a {c!r} object instead.
de: Der Parameter {p!r} ist kein sequentieller Typ, aber statt dessen vom Typ {c!r}.

source: The method {met}() expected at most {max} arguments, got {got}.
de: Die Methode {met}() erwartet höchstens {max} Argumente, hat aber {got} erhalten.

source: {} is a tty.
de: {} ist ein tty.

source: Platform is Windows and not ansi_term.
de: Die Plattform ist Windows und nicht ansi_term.

source: {} is not a tty.
de: {} ist kein tty.

source: Given value is {!r}.
de: Der übergebene Wert ist {!r}.

source: Could not determine bytes in {!r}.
de: Konnte die Bytes nicht in {!r} ermitteln.

source: Couldn't detect unit {!r}.
de: Konnte die Maßeinheit in {!r} nicht ermitteln.

source: Argument {a!r} must be of type {t1!r} or {t2!r}.
de: Das Argument {a!r} muss vom Typ {t1!r} oder {t2!r} sein.

source: Encoding {v!r} must be a {s!r} object, but is a {c!r} object instead.
de: Die Kodierung {v!r} muss ein {s!r}-Objekt sein, ist aber statt dessen ein {c!r}-Objekt.

source: A configuration directory may not be None.
de: Ein Konfigurations-Verzeichnis darf nicht None sein.

source: A configuration file may not be None.
de: Eine Konfigurations-Datei darf nicht None sein.

source: Configuration file {!r} exists, but is not a regular file.
de: Die Konfigurations-Datei {!r} existiert, ist aber keine reguläre Datei.

source: Searching for {!r} ...
de: Suche nach {!r} …

source: Configuration file {!r} not found.
de: Die Konfigurations-Datei {!r} wurde nicht gefunden.

source: Configuration file error
de: Konfigurationsdatei-Fehler

source: Reading {!r} ...
de: Lese {!r} …

source: Wrong configuration in {!r} found
de: Falsche Konfiguration in {!r} gefunden

source: Configuration parse error
de: Fehler beim Parsen der Konfiguration

source: Checking config section {!r} ...
de: Überprüfe Konfigurationsabschnitt {!r} …

source: This is a base DDNS related application.
de: Das ist eine DDNS-bezogene Basisanwendung.

source: Invalid user agent {!r} given.
de: Ungültiger User-Agent {!r} übergeben.

source: DDNS options
de: DDNS-Optionen

source: Perform action only for {}.
de: Führe die Aktion nur für {} aus.

source: The IP protocol, for which the action should be performed (one of {c}, default {d!r}).
de: Das IP-Protokoll, für das die Aktion ausgeführt werden soll (eins ais {c}, Vorgabe {d!r}).

source: PROTOCOL
de: PROTOKOLL

source: DIRECTORY
de: VERZEICHNIS

source: The directory, where to read and write the cache files of the evaluated IP addresses (default: {!r}).
de: Das Verzeichnis, von wo Cache-Dateien mit den ermittelten IP-Adresses und wohin sie auch geschrieben werden (Vorgabe: {!r}).

source: The timeout in seconds for Web requests (default: {}).
de: Die Zeit für die Zeitüberschreitung in Sekunden für Web-Abfragen (Vorgabe: {}).

source: By default, every secure connection {app} makes is verified to be secure before the request takes place. This option makes {app} skip the verification step and proceed without checking.
de: Normalerweise wird von {app} jede sichere Verbindung vor der Abfrage überprüft, ob sie wirklich sicher ist. Diese Option veranlaßt {app}, diese Überprüfung zu überspringen und weiterzufahren.

source: Invalid value {!r} as timeout:
de: Ungültiger Wert {!r} für die Zeit der Zeitüberschreitung:

source: Setting Loglevel of the {m} module to {ll}.
de: Setze Loglevel des {m}-Moduls auf {ll}.

source: Trying to get my public IPv{} address.
de: Versuche meine öffentliche IPv{}-Adresse zu ermitteln.

source: Got a response:
de: Erhaltene Antwort:

source: Request method: {!r}
de: Request-Methode: {!r}

source: Simulation mode, Request will not be sent.
de: Simulationsmodus, der Request wird nicht gesendet.

source: Got a {c} on requesting {u!r}: {e}.
de: Habe ein {c} bei der Abfrage von {u!r} erhalten: {e}.

source: Failed to parse the response
de: Konnte Rückgabe nicht auswerten

source: Text response:
de: Erhaltene textuelle Antwort:

source: Setting encoding of response to {!r}.
de: Setze Codierung der Antwort auf {!r}.

source: Checking existence and accessibility of working directory {!r} ...
de: Überprüfe Existenz und Verfügbarkeit des Arbeitverzeichnisses {!r} …

source: No read access
de: Kein Lesezugriff

source: No write access
de: Kein Schreinzugriff

source: Writing IP address {a!r} into {f!r} ...
de: Schreibe IP-Adresse {a!r} nach {f!r} …

source: File {!r} not found.
de: Datei {!r} nicht gefunden.

source: Reading IP address from {!r}...
de: Lese IP-Adresse aus {!r} …

source: Line {li!r} in {f!r} is not a valid IP address:
de: Zeile {li!r} in {f!r} ist keine gültige IP-Adresse:

source: Using resolver:
de: Verwende Resolver:

source: Did not found a {t} address for {n}:
de: Fand keine {t}-Adresse für {n}:

source: Cannot execute {method}() - module {mod!r} could not imported.
de: Kann Methode {method]() nicht ausführen - das Modul {mod!r} konnte nicht importiert werden.

source: Did not found a {t} entry for zone {z}:
de: Fand keinen {t}-Eintrag für Zone {z}:

source: Invalid timeout {!r} for Web requests, must be 0 < SECONDS < 3600.
de: Ungültige Zeit {!r} für eine Zeitüberschreitung für aine Webabfrage, sie muss zwischen 0 und 3600 Sekunden liegen.

source: Invalid value {u!r} for protocols to update in section {s!r}, valid protocols are:
de: Ungültiger Wert {u!r} für Protokolle zum Update in Abschnitt {s!r} angegeben, gültige Protokolle sind:

source: Invalid forced update interval in section {!r}:
de: Ungültiges Intervall für forcierte Updates in Abschnitt {s!r} angegeben:

source: Unknown configuration option {o!r} with value {v!r} in section {s!r}.
de: Unbekannte Konfigurationsoption {o!r} mit dem Wert {v!r} in Abschnitt {s!r}.

source: The path to the working directory must be an absolute path (given: {!r}).
de: Der Pfad zum Arbeitsverzeichnis muss ein absoluter Pfad sein (gegeben: {!r}).

source: The path to the logfile must be an absolute path (given: {!r}).
de: Der Pfad zur Logdatei muss absolut sein (gegeben: {!r}).

source: Got an error {c} on requesting {u!r}: {m}
de: Habe einen Fehler {c} beim Abfrage der URL {u!r} erhalten: {m}

source: There is a problem with the update status file {!r}
de: Es gibt ein Problem mit der Update-Statusdatei {!r}

source: There is a problem with the working directory {!r}
de: Es gibt ein Problem mit dem Arbeitsverzeichnis {!r}

source: Working directory {!r} does not exists
de: Das Arbeitsverzeichnis {!r} existiert nicht

source: Invalid permissions for working directory {!r}
de: Ungenügende Rechte für das Arbeitsverzeichnis {!r}

source: Tries to detect the public NAT IPv4 address and/or the automatic assigned IPv6 address in a local network and print it out.
de: Versucht die öffentliche NAT-IPv4-Adresse bzw. die automatisch zugewiesene IPv6-Adresse in einem lokalem Netzwerk zu ermitten und zu zeigen.

source: Use only {} to retreive the public IP address.
de: Verwende nur {}, um die öffentliche IP-Adresse zu ermiteln.

source: The IP protocol, for which the public IP should be retrieved (one of {c}, default {d!r}).
de: Das IP-Protokoll, für welches die öffentliche IP-Adresse ermittelt werden soll (eins aus {c}, Vorgabe: {d!r}).

source: myip options
de: Optionen für myip

source: Write found public IPs into a cache file in working directory.
de: Schreibe die gefundenen öffentliche IP-Adressen in eine Cache-Datei im Arbeitsverzeichnis zurück.

source: Starting {a!r}, version {v!r} ...
de: Starte {a!r}, Version {v!r} …

source: No valid domain given on initialization of a {} object.
de: Keine gültige Domäne bei der Initialisierung eines {}-Objektes angegeben.

source: Invalid domain {!r} given, whitespaces are not allowed.
de: Ungültige Domäne angegeben, Leerzeichen sind nicht erlaubt.

source: A timestamp must not be None.
de: Ein Timeout darf nicht None sein.

source: Checking working directory {d!r} for updating {what} ...
de: Überprüfe Arbeitsverzeichnis {d!r} zur Aktualisierung von {what} …

source: working directory is not a path object.
de: Das Arbeitsverzeichnis ist kein Path-Objekt.

source: working directory is not readable.
de: Das Arbeitsverzeichnis ist nicht lesbar.

source: working directory is not writeable.
de: Das Arbeitsverzeichnis ist nicht beschreibbar.

source: Checking update status file {!r} ...
de: Überprüfe Aktualisierungs-Statusdatei {!r} …

source: Update status file {!r} does not exists.
de: Die Aktualisierungs-Statusdatei {!r} existiert nicht.

source: update status file is not readable.
de: die Aktualisierungs-Statusdatei ist nicht lesbar.

source: update status file is not writeable.
de: die Aktualisierungs-Statusdatei ist nicht beschreibbar.

source: Write status into {!r} ...
de: Schreibe Status in {!r} …

source: Data to write in status file:
de: Daten, die in die Statusdatei geschrieben werden:

source: Simulation mode, file {!r} will not be written.
de: Simulationsmodus, die Datei {!r} wird nicht geschrieben.

source: Read status from {!r} ...
de: Lese Status aus {!r} …

source: Read data from YAML:
de: Gelesene Daten aus YAML:

source: no timestamp of last update found.
de: kein Zeitstempel der letzten Aktualisierung gefunden.

source: Updating the DDNS records, even if seems not to be changed.
de: Aktualisieren der DDNS-Einträge, auch wenn sie nicht verändert zu sein scheinen.

source: Tries to update the A and/or AAAA record at ddns.de with the current IP address.
de: Versucht den A- bzw. AAAA-Eintrag bei ddns.de mit der aktuellen IP-Adresse zu aktualisieren.

source: Update only the {} record with the public IP address.
de: Aktualisiere nur den {}-Eintrag mit der aktuellen IP-Adresse.

source: The IP protocol, for which the appropriate DNS record should be updated with the public IP (one of {c}, default {d!r}).
de: Das IP-Protokoll, für welches der entsprechende DNS-Eintrag der üffentlichen IP aktualisiert werden soll (eins aus {c}, Vorgabe {d!r}).

source: Update DDNS options
de: DDNS-Aktualisierungsoptionen

source: USER
de: BENUTZER

source: The username to login at ddns.de.
de: Der Nutzername, um sich bei ddns.de eizuloggen.

source: PASSWORD
de: PASSWORT

source: The password of the user to login at ddns.de.
de: Das Login-Passwort des Nutzers bei ddns.de.

source: Update all domains, which are connected whith the given ddns account.
de: Aktualisirung alle Domänen, die mit dem gegebenen DDNS-Konto verbunden sind.

source: DOMAIN
de: DOMÄNE

source: The particular domain(s), which should be updated (if not all).
de: Die einzelnen Domäne(n), die aktualisiert werden sollen (wenn nicht alle aktualisiert werden sollen).

source: Ending {a!r}.
de: Beende {a!r}.

source: Actions before running.
de: Aktionen vor Beginn.

source: No domains to update given, but the option all domains is deactivated.
de: Keine Domänen zur Aktualisierungg angegeben, aber die Option 'für alle Domänen' ist deaktiviert.

source: Found current {t} address {a}.
de: Fand aktuell {t}-Adresse {a}.

source: Address {a!r} seems not to be a valid {w} address: {e}
de: Die Adresse {a!r} scheint keine gültige {w}-Adresse zu sein: {e}

source: Got no public {} address.
de: Keine öffentliche {}-Adresse gefunden.

source: Currently configured dynamic addresses:
de: Aktuell konfigurierte dynamische Adressen:

source: Did not found update status file {!r}.
de: Aktualisierungs-Statusdatei {!r} nicht gefunden.

source: {c} - could not evaluate update status file {f!r}: {e}
de: {c} - konnte Aktualisierungs-Statusdatei {f!r} nicht auswerten: {e}

source: Last update was at {dt} with status {st!r}.
de: Die letzte Aktualisierung war {dt} mit dem Status {st!r}.

source: Last update of domain {dom!r} is {delta} ago.
de: Die letzte Aktualisierung der Domäne {dom!r} war vor {delta}.

source: Checking the need for updating the given domain {!r}.
de: Überprüfe Notwendigkeit zum Aktualisieren der angegebenen Domäne {!r}.

source: Updating the DDNS records of domain {!r}, although if they seems not to be changed.
de: Aktualisieren der DDNS-Einträge der Domäne {!r}, auch wenn sie nicht verändert zu sein scheinen.

source: Update of domain {!r} is not necessary.
de: Die Aktualisierung der Domäne {!r} ist nicht notwendig.

source: Updating the DDNS records of domain {!r}.
de: Aktualisiere DDNS-Einträge der Domäne {!r}.

source: Simulation mode, update of domain {!r} will not be sended.
de: Simulationsmodus, die Aktualisierung der Domäne {!r} wird nicht gesendet.

source: No response from {}.
de: Keine Antwort von {}.

source: Response from {}:
de: Antwort von {}:

source: Update all domains at {} with found dynamic external addresses ...
de: Aktualisierung aller Domänen mit den gefundenen externen Adressen …

source: Simulation mode, update of all domains will not be sended.
de: Simulationsmodus, die Aktualisierung aller Domänen wird nicht gesendet.

source: Config loader method {!r} was not found.
de: Die Konfigurations-Lade-Methode {!r} wurde nicht gefunden.

source: Empty mail address.
de: Leere Mailadresse.

source: Wrong mail address {a!r} ({c})
de: Ungültige Mailadresse {a!r} ({c})

source: Wrong time interval {!r}.
de: Ungültiges Zeitintervall

source: Process with PID {pid} got signal {signal}.
de: Der Prozess mit der PID {pid} hat das Signal {signal} erhalten.

source: The network {!r} is not existing.
de: Das Netzerk {!r} existiert nicht.

source: Method {func}() has to be overridden in class {cls!r}.
de: Die Methode {func}() der Klasse {cls!r} muss überschrieben werden.

source: (timeout after {:0.1f} secs)
de: (Timeout nach {:0.1f} Sekunden)

source: Timeout error on reading
de: Timeout-Fehler beim Lesen

source: Timeout error on writing
de: Timeout-Fehler beim Schreiben

source: Timeout on answering on the console.
de: Zeitüberschreitung beim Antworten an der Konsole.

source: Unknown OS command.
de: Unbekanntes Betriebssystem-Kommando.

source: Empty command list given.
de: Leere Kommando-Liste übergeben.

source: Could not found OS command:
de: Konnte das Betriebssystem-Kommando nicht finden:

source: Couldn't occupy lockfile {lf!r} in {d:0.1f} seconds with {tries} tries.
de: Konnte die Lock-Datei {lf!r} nicht in {d:0.1f} Sekunden mit {tries} Versuchen vereinnahmen.

source: There is a problem with path {!r}
de: Es gibt ein Problem mit dem Pfad {!r}

source: There is a problem with directory {!r}
de: Es gibt ein Problem mit dem Verzeichnis {!r}

source: Directory {!r} does not exists
de: Das Verzeichnis {!r} existiert nicht

source: Path {!r} is not a directory
de: Der Pfad {!r} ist kein Verzeichnis.

source: Invalid permissions for directory {!r}
de: Ungültige Zugriffsrechte auf das Verzeichnis {!r}

source: There is a problem with file {!r}
de: Es gibt ein Problem mit der Datei {!r}

source: File {!r} does not exists
de: Die Datei {!r} existiert nicht

source: Path {!r} is not a regular file
de: Der Pfad {!r} ist keine reguläre Datei

source: Invalid permissions for file {!r}
de: Ungültige Zugriffsrechte auf die Datei {!r}

source: Timeout error on reading from socket
de: Timeout-Fehler beim Lesen vom Sockel

source: Timeout error on writing to socket
de: Timeout-Fehler beim Schreiben auf den Sockel

source: Value must be at least {m} - {v} was given.
de: Der Wert muss mindestens {m} sein - {v} wurde gegeben.

source: The given pattern {!r} is not a valid date pattern
de: Das übergebene Muster {!r} is kein gültiges Datums-Muster

source: . The must be exactly one occurence of '%Y', one of '%m' and one of '%d'.
de: . Es muss exakt einmal '%Y', einmal '%m' und einmal '%d' angegeben werden.

source: Returns a newline separated list of files generated from file globbing patterns given as arguments to this application, where all files are omitted, which should not be removed.
de: Gibt eine mit Zeilenumbruch separierte Liste von Dateien zurück, die aus dem Datei-Muster, welches als Kommando-Zeilen-Argument dieser Anwendung übergeben wurde, generiert wurde, wobei alle Datein fehlen, welche nicht gelöscht werden sollen.

source: Wrong value {v!r} for {n}, must be >= {m}
de: Ungültiger Wert {v!r} für {n}, muss größer als oder gleich {m} sein

source: File options
de: Datei-Optionen

source: File pattern to generate list of files to remove.
de: Dateimuster, um die Liste der zu löschenden Dateien zu generieren.

source: Keep options
de: Optionen zum Aufbewahren

source: NR_FILES
de: ANZAHL_DATEIEN

source: How many of the last files should be kept (default: {default}, minimum: {min})?
de: Wieviele der letzten Dateien sollen aufbewahrt werden (Vorgabe: {default}, Minimum {min})?

source: DAYS
de: TAGE

source: How many files one per day from today on should be kept (default: {default}, minimum: {min})?
de: Wieviele Dateien (eine pro Tag) sollen von heute an rückwärts aufbewahrt werden (Vorgabe: {default}, Minimum {min})?

source: WEEKS
de: WOCHEN

source: How many files one per week from today on should be kept (default: {default}, minimum: {min})?
de: Wieviele Dateien (eine pro Woche) sollen von heute an rückwärts aufbewahrt werden (Vorgabe: {default}, Minimum {min})?

source: MONTHS
de: MONATE

source: How many files one per month from today on should be kept (default: {default}, minimum: {min})?
de: Wieviele Dateien (eine pro Monat) sollen von heute an rückwärts aufbewahrt werden (Vorgabe: {default}, Minimum {min})?

source: YEARS
de: JAHRE
