Repository: pypi-data/pypi-mirror-355
Catalog: packages/fb-tools/fb_tools-2.8.1.tar.gz/fb_tools-2.8.1/locale/*/LC_MESSAGES/fb_tools.po
Languages: de

source: Given: {!r}
de: Übergeben: {!r}.

source: The timeout for a socket operation must be less or equal to {}.
de: Ein Timeout für eine Sockel-Operation muss kleiner oder gleich {} sein.

source: The request queue size must be at least a non nagetive value.
de: Die Request-Queue-Größe muss einen nicht-negativen Wert haben.

source: The request queue size must be less or equal to {}.
de: Die Request-Queue-Größe muss kleiner oder gleich {} sein.

source: The buffer size must be at least {} bytes.
de: Die Puffergröße muss wenigstens {} Bytes sein.

source: The buffer size must be less or equal to {} bytes.
de: Die Puffergröße muss kleiner oder gleich {} sein.

source: The buffer size must be a multiple of 512 bytes.
de: Die Puffergröße muss ein Vielfaches von 512 Bytes sein.

source: Did not found encoding {!r}.
de: Codierung {!r} nicht gefunden.

source: An intervall between polling attempts from socket must be greater than zero.
de: Das Intervall zwischen den Abfrageversuchen vom Sockel muss größer als Null sein.

source: The intervall between polling attempts from socket must be less or equal to {}.
de: Das Intervall zwischen den Abfrageversuchen vom Sockel muss kleiner oder gleich {} sein.

source: Closing socket ...
de: Schließe Sockel …

source: Resetting socket connection ...
de: Setze Sockel-Verbindung zurück …

source: Cannot send message to the receipient, because the socket connection is interrupted.
de: Kann die Nachricht nicht zum Empfänger senden, da die Sockel-Verbindung unterbrochen wurde.

source: Cannot send message to the receipient, because the socket connection is closed.
de: Kann die Nachricht nicht zum Empfänger senden, da die Sockel-Verbindung geschlossen wurde.

source: Sending {!r} to socket.
de: Sende {!r} zum Sockel.

source: Cannot accept connection, socket is not bonded.
de: Kann die Verbindung nicht accepten, da der Sockel nich gebunden ist.

source: Accept a connection ...
de: Accepte Verbindung …

source: Got a request from {!r}.
de: Habe einen Request von {!r} erhalten.

source: Got a request from somewhere on the system.
de: Habe einen Request von irgendwo aus dem System erhalten.

source: Trying to get data ...
de: Versuche die Daten zu bekommen …

source: Got data: {!r}.
de: Erhaltene Daten: {!r}

source: Got EOF, counterpart has interrupted ...
de: Habe EOF erhalten, die Gegnstelle hat unterbrochen …

source: Socket has data.
de: Der Sockel hat Daten.

source: Socket has no data.
de: Der Sockel hat keine Daten.

source: Get input buffer ...
de: Eingabepuffer erhalten …

source: Current input buffer: {!r}
de: Aktueller Eingabepuffer: {!r}

source: Performing input buffer {!r}
de: Verarbeite Eingabepuffer {!r}

source: Got a line: {!r}
de: Erhaltene Zeile: {!r}

source: Current input buffer after read_line(): {!r}
de: Aktueller Eingabepuffer nach read_line(): {!r}

source: The TCP port number must be a positive integer value, not {!r}.
de: Die TCP-Portnummer muss ein positiver Integer-Wert sein, nicht {!r}.

source: The TCP port number must be less than or equal to {max}, not {cur!r}.
de: Die TCP-Portnummer muss kleiner oder gleich {max} sein, nicht {cur!r}.

source: Cannot connect to an undefined IP address or hostname.
de: Kann nicht zu einer undefinierter IP-Adresse oder Hostnamen verbinden.

source: Connecting to address {addr!r}, port {port} by TCP ...
de: Verbinde zu Adresse {addr!r}, Port {port} über TCP …

source: The socket is already connected to {addr!r}, port {port}.
de: Der Sockel ist bereits mit {addr!r}, Port {port} verbunden.

source: The application is already bonded to address {addr!r}, port {port}.
de: Die Anwendung ist bereits auf die Adresse {addr!r}, Port {port} gebunden.

source: No valid address for host {!r} found.
de: Keine gültige Adresse für Host {!r} gefunden.

source: Creating a listening TCP socket on address {addr!r}, port {port} ...
de: Erstelle einen Listener-TCP-Sockel auf Adresse {addr!r}, Port {port} …

source: The socket is already connected to address {addr!r}, port {port}.
de: Der Sockel ist bereits mit Adresse {addr!r}, Port {port} verbunden.

source: Got socket addresses:
de: Erhaltene Sockel-Adresse:

source: Binding to socket address {!r}.
de: Binde an Sockel-Adresse {!r}.

source: The Unix socket file {!r} was not found.
de: Die Unix-Sockel-Datei {!r} wurde nicht gefunden.

source: Invalid permissions to connect to Unix socket {!r}.
de: Ungültige Zugriffsrechte auf den Unix-Sockel {!r}.

source: A UNIX socket filename may not be None.
de: Eine Unix-Sockel-Datei darf nicht None sein.

source: The UNIX socket filename {!r} must be an absolute filename.
de: Der Unix-Sockel-Dateiname {!r} muss ein absoluter Pfad sein.

source: Wrong socket mode {!r}:
de: Ungültiger Sockel-Mode {!r}:

source: Invalid UID {!r} for socket owner given.
de: Ungültige UID {!r} für den Sockel-Besitzer übergeben.

source: Username {!r} as the owner for the UNIX socket file not found.
de: Der Nutzername {!r} als Besitzer der Unix-Sockel-Datei wurde nicht gefunden.

source: Invalid GID {!r} for socket file group given.
de: Ungültige GID {!r} für die Gruppe der Unix-Sockel-Datei übergeben.

source: Groupname {!r} as the group for the UNIX socket file not found.
de: Der Gruppenname {!r} als Gruppe der Unix-Sockel-Datei wurde nicht gefunden.

source: Removing socket file {!r} ...
de: Lösche Sockel-Datei {!r} …

source: Connecting to Unix Domain Socket {!r} ...
de: Verbinde mit Unix-Domain-Sockel {!r} …

source: The socket is already connected to {!r} ...
de: Der Sockel ist bereits mit {!r} verbunden …

source: The application is already bonded to {!r} ...
de: Die Anwendung ist bereits an {!r} gebunden …

source: Error connecting to Unix Socket {sock!r}: {e}
de: Fehler beim Verbinden mit Unix-Sockel {sock!r}: {e}

source: Setting permissions of {sock!r} to 0o{mode} ...
de: Setze Rechte auf {sock!r} auf 0o{mode} …

source: Only root may change the ownership of a socket.
de: Nur root darf die Besitzerschaft eines Sockels ändern.

source: Setting owner and group of {sock!r} to {uid}:{gid} ({owner}:{group}) ...
de: Setze Besitzer und Gruppe von {sock!r} auf {uid}:{gid} ({owner}:{group}) …

source: Creating and bind to Unix Socket {!r} ...
de: Erstelle und binde an Unix-Sockel {!r} …

source: Start listening on socket with a queue size of {}.
de: Starte Listening an Sockel mit einer Queue-Größe von {}.

source: Spinner {!r} not found.
de: Spinner {!r} nicht gefunden.

source: Module directory:
de: Modul-Verzeichnis:

source: Lib directory:
de: Lib-Verzeichnis:

source: Base directory:
de: Basis-Verzeichnis:

source: Locale directory:
de: Verzeichnis für Locales:

source: Locale domain:
de: Locale-Domäne:

source: Found .mo-file:
de: Gefundene .mo-Datei:
