# -*- coding: utf-8 -*-
# @Project: 芒果测试平台
# @Description: 错误消息统一管理
# @Time   : 2024-02-01 10:00
# @Author : 毛鹏
ERROR_MSG_0001 = (3001, '连接错误，请检查IP，端口，账号，密码')
ERROR_MSG_0002 = (3002, '缓存中无法获取到：{}的值')
ERROR_MSG_0003 = (3003, 'jsonpath表达式错误，请检查表达式：{}')
ERROR_MSG_0004 = (3004, '数据不可以被转换成json')
ERROR_MSG_0006 = (3006, '随机字符串函数只支持传入int类型数字')
ERROR_MSG_0033 = (3033, 'mysql中无：{}库')
ERROR_MSG_0034 = (3034, 'sql存在语法错误，sql：{}')
ERROR_MSG_0035 = (3035, 'sql语句是空，或查询字段或条件字段不存在')
ERROR_MSG_0047 = (3047, '方法不存在，请检查输入的方法名称是否正确')
ERROR_MSG_0061 = (3061, '前置或者后置的自定义函数没有按照文档规范填写，或者语法不正确，请参照文档后重新填写')
ERROR_MSG_0014 = (3014, '企微发送失败，请检查企微发送配置')
ERROR_MSG_0015 = (3015, '的类型错误，请联系管理员进行排查问题')
ERROR_MSG_0016 = (3016, '邮件发送失败，请检查邮件的配置')
ERROR_MSG_0017 = (3017, '断言失败，提示： {}')
ERROR_MSG_0018 = (3018, 'webhook的链接错误！')