def help():
    return '''
3 билет:
Метод функциональной итерации
Метод степеней
Метод Эйлера и Рунге -Кутты 4 порядка

4 билет:
Метод ньютона и функциональные итерации(теория)
Наивный алгоритм Штрассена 
БПФ и ДПФ (в анализе вр. рядов сгенерируйте сигнал длины 16…)

5 билет:
Кубическая сплайн интерполяция 
Наивный алгоритм умножения матриц и теория по алгоритму штрассена 

7 билет:
Интерполяция многочленом Лагранжа 
Наивный алгоритм умножения матриц и алгоритм штрассена 
Метод Адамса -Мултона и метод Эйлера.

9,14 билет:
Метод Гаусса-Зейделя  и сравнить с методом Ньютона.
QR разложение и метод главных компонент.
ДПФ и БПФ (сгенерируйте сигнал длины 64:…..) 

15 билет:
Интерполяция многочленом Лагранжа
Перемножение методом Штрассена.
Центральная разность для апроксимации.

18 билет:
Метод Ньютона и сравнить потом с методом диссекции.
Метод степеней с начальным вектором и потом вопрос про спектральный радиус.
Метод Рунге - Кутты 4-го порядка.

29 билет:
Метод Гаусса - Зейделя и потом сравнить с методом Ньютона.
Наивный алгоритм умножения матриц, алгоритм Штрассена  и потом вопрос по суммированию по Кохану.

30 билет:
Метод Ньютона и потом вопрос про ошибку  округления.
Наивный алгоритм умножения матриц и потом вопрос про Штрассена 
Метод Рунге-Кутты 4-го порядка и вопрос про фазовый портрет.
Непонятный билет:
ДПФ и БПФ (сгенерируйте сигнал длины 64:…..)

Непонятный билет 2:
метод функциональной итерации и вопрос про параметр ускорения сходимости.
Метод степеней и вопрос про зазор между собственными значениями и lineprofiler.
БПФ и амплитудный спектр и вопрос про ДПФ и БПФ.
    '''
def bilet3():
    return '''
    '''
