Repository: pypi-data/pypi-mirror-355
Catalog: packages/pyams-workflow/pyams_workflow-2.2.0-py3-none-any.whl/pyams_workflow/locales/*/LC_MESSAGES/pyams_workflow.po
Languages: fr

source: -- unknown --
fr: -- inconnu --

source: {date} by {principal}
fr: {date} par {principal}

source: Clone created from version {source} (in « {state} » state)
fr: Copie créée à partir de la version {source} (alors en statut « {state} »)

source: Transition ID
fr: ID de la transition

source: Version ID
fr: N° de version

source: Version state
fr: Statut

source: State date
fr: En date du

source: Date at which the current state was applied
fr: Date à laquelle ce statut a été appliqué

source: State principal
fr: Mandataire

source: ID of the principal which defined current state
fr: ID du mandataire qui a défini ce statut

source: Urgent request?
fr: Demande urgente ?

source: Workflow name
fr: Nom du workflow

source: Name of workflow utility managing this content
fr: Nom du workflow associé à ce contenu

source: View permission
fr: Permission de visualisation

source: This permission will be required to display content
fr: Cette permission sera nécessaire pour afficher ce contenu

source: Display first version date
fr: Afficher la date de publication de la première version

source: Display current version date
fr: Afficher la date de publication de cette version

source: Display content publication date
fr: Date de publication du contenu

source: Publication date
fr: Date de publication

source: Last date at which content was accepted for publication
fr: Date à laquelle ce contenu a été accepté pour sa publication

source: Publisher
fr: Éditeur

source: Name of the manager who published the document
fr: Nom du responsable de la publication du document

source: Last publication date and actor
fr: Date et nom du mandataire responsable de la dernière publication

source: First version publication date
fr: Mise en ligne de cette version

source: First date at which content version was accepted for publication
fr: Première date à laquelle cette version de ce contenu a pu être consultée par les internautes

source: First content publication date
fr: Mise en ligne du contenu

source: First date at which first content version was accepted for publication
fr: Première date à laquelle la première version de ce contenu a pu être consultée par les internautes

source: Publication start date
fr: Début de publication

source: Date from which content will be visible
fr: Date à partir de laquelle cette version du contenu sera visible

source: Push end date
fr: Mettre en avant jusqu'au

source: Some contents can be pushed by components to front-office pages; if you set a date here, this content will not be pushed anymore passed this date, but will still be available via search engine or direct links
fr: Certains contenus peuvent être "poussés" en front-office par certains composants ; si vous indiquez une date ici, ce contenu ne sera plus poussé au-delà de cette date, mais restera accessible via un moteur de recherche ou des liens directs (à la différence de contenus retirés ou archivés)

source: Can't define push end date without publication start date!
fr: Vous ne pouvez pas définir de date de fin de mise en avant sans date de début de publication

source: Push end date must be defined after publication start date!
fr: La date de fin de mise en avant doit être définie après la date de début de publication !

source: Push end date must be null or defined before publication end date!
fr: La date de fin de mise en avant doit être nulle ou définie avant la date de fin de publication !

source: Publication end date
fr: Retrait automatique le

source: Date past which content will not be visible
fr: Date au-delà de laquelle ce contenu ne sera plus visible

source: Can't define publication end date without publication start date!
fr: Vous ne pouvez pas définir une date de fin de publication sans date de début !

source: Publication end date must be defined after publication start date!
fr: La date de fin de publication doit être définie après la date de début !

source: Displayed publication date
fr: Date de publication affichée

source: The matching date will be displayed in front-office
fr: Sélection de la date de publication affichée en front-office

source: Please use this option only when really needed...
fr: N'utilisez cette option que lorsque c'est vraiment nécessaire...

source: Comment
fr: Commentaire

source: Comment associated with this operation
fr: Commentaire associé à cette opération

source: Version history
fr: Historique de la version

source: New state
fr: Nouveau statut

source: Modifier
fr: Modifié par

source: Version {version} history
fr: Historique de la version {version}

source: History of this version
fr: Historique de cette version

source: Change status...
fr: Agir sur le statut...
